import {WorkExperience} from "../interfaces/work-experience";

export let StepperData: WorkExperience[] = [
  {
    jobTitle: 'Программист',
    workDate: 'Январь 2022 - настоящее время',
    jobName: 'АО «НПК ВТиСС»',
    description: 'Разработка web приложения военного и гражданского назначения с использованием фреймворка Angular.  Поддержка, доработка и тестирование реализованного функционала.Исправление ошибок возникающих в процессе разработки. Участие в проектировании интерфейса приложений. Интеграция с внутренними API'
  },
  {
    jobTitle: 'Администратор торгового зала',
    workDate: 'Февраль 2020 - Декабрь 2021',
    jobName: 'ИП Виноградов',
    description: 'Продажа табачной продукции. Продажа и первичная настройка электронных сигарет, консультирование клиентов по ассортименту магазина, ведение групп в социальных сетях.'
  },
  {
    jobTitle: 'Специалист технической поддержки',
    workDate: 'Август 2019 - Сентябрь 2019',
    jobName: 'АО "Калуга Астрал"',
    description: 'Консультация пользователей по работе в приложении Астрал Отчет. Выполнение первичной диагностики ошибок. Помощь в устранении ошибок, неисправностей. Выполнение настроек системы. Регистрация инцидентов по обращениям пользователей.'
  },
  {
    jobTitle: 'Менеджер по продажам оборудования / Администратор торгового зала',
    workDate: 'Ноябрь 2016 - Август 2019',
    jobName: 'ИП Писаревский',
    description: 'Продажа и первичная настройка электронных сигарет, продажа доп.оборудования, консультирование клиентов по ассортименту магазина, ведение групп в социальных сетях, прием и расстановка товара, заполнение рабочей документации, подбор персонала'
  },
]
