import {WorkExperience} from "../interfaces/work-experience";

export let StepperData: WorkExperience[] = [
  {
    jobTitle: 'Программист',
    workDate: 'Январь 2022 - настоящее время',
    jobName: 'АО «НПК ВТиСС»',
    description: 'Разработка web приложения военного и гражданского назначения с использованием фреймворка Angular.\n' +
      '\nПоддержка, доработка и тестирование реализованного функционала.\n'+
      '\nИсправление ошибок возникающих в процессе разработки.\n'+
      '\nУчастие в проектировании интерфейса приложений. Интеграция с внутренними API'
  },
  {
    jobTitle: 'Администратор торгового зала',
    workDate: 'Февраль 2020 - Декабрь 2021',
    jobName: 'ИП Виноградов',
    description: 'Розничные продажи. \n' +
      '\n' +
      'Продажа и первичная настройка оборудования. \n' +
      '\n' +
      'Консультирование клиентов по ассортименту магазина.\n' +
      '\n' +
      'Закупка товара/оборудования. \n' +
      '\n' +
      'Ведение групп в социальных сетях. '
  },
  {
    jobTitle: 'Специалист технической поддержки',
    workDate: 'Август 2019 - Сентябрь 2019',
    jobName: 'АО "Калуга Астрал"',
    description: 'Консультация пользователей по работе в приложении Астрал Отчет.\n'+
      '\nВыполнение первичной диагностики ошибок.\n'+
      '\nПомощь в устранении ошибок, неисправностей.\n'+
      '\nВыполнение настроек системы.\n'+
      '\nРегистрация инцидентов по обращениям пользователей.'
  },
  {
    jobTitle: 'Менеджер по продажам оборудования / Администратор торгового зала',
    workDate: 'Ноябрь 2016 - Август 2019',
    jobName: 'ИП Писаревский',
    description: 'Продажа и первичная настройка обурдования\n'+
      '\nПродажа доп.оборудования.\n'+
      '\nКонсультирование клиентов по ассортименту магазина\n'+
      '\nВедение групп в социальных сетях\n'+
      '\nПрием и расстановка товара\n'+
      '\nЗаполнение рабочей документации\n'+
      '\nПодбор персонала'
  },
]
